Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1025DAG176.PIC
      <edc:SFRDef edc:_addr="0x1F84B0D4" edc:_begin="0x88" edc:_end="0x8c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="22" edc:access="---nnnnn-nnnnnnn------nnnnnnnnnn" edc:cname="ADC0TIME" edc:desc="" edc:impl="0x1f7f03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000-0000000------0000000000" edc:name="ADC0TIME" edc:nzwidth="32" edc:por="---00000-0000000------0000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0D8" edc:_begin="0x88" edc:_end="0x8c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="23" edc:access="---nnnnn-nnnnnnn------nnnnnnnnnn" edc:cname="ADC1TIME" edc:desc="" edc:impl="0x1f7f03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000-0000000------0000000000" edc:name="ADC1TIME" edc:nzwidth="32" edc:por="---00000-0000000------0000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0DC" edc:_begin="0x88" edc:_end="0x8c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="24" edc:access="---nnnnn-nnnnnnn------nnnnnnnnnn" edc:cname="ADC2TIME" edc:desc="" edc:impl="0x1f7f03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000-0000000------0000000000" edc:name="ADC2TIME" edc:nzwidth="32" edc:por="---00000-0000000------0000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0E0" edc:_begin="0x88" edc:_end="0x8c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="25" edc:access="---nnnnn-nnnnnnn------nnnnnnnnnn" edc:cname="ADC3TIME" edc:desc="" edc:impl="0x1f7f03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000-0000000------0000000000" edc:name="ADC3TIME" edc:nzwidth="32" edc:por="---00000-0000000------0000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0E4" edc:_begin="0x88" edc:_end="0x8c" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="26" edc:access="---nnnnn-nnnnnnn------nnnnnnnnnn" edc:cname="ADC4TIME" edc:desc="" edc:impl="0x1f7f03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000-0000000------0000000000" edc:name="ADC4TIME" edc:nzwidth="32" edc:por="---00000-0000000------0000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F84B0E8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x1F84B0F0" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="27" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCEIEN1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCEIQEN1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIEN0" edc:mask="0x1" edc:name="EIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN1" edc:mask="0x1" edc:name="EIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN2" edc:mask="0x1" edc:name="EIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN3" edc:mask="0x1" edc:name="EIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN4" edc:mask="0x1" edc:name="EIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN5" edc:mask="0x1" edc:name="EIEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN6" edc:mask="0x1" edc:name="EIEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN7" edc:mask="0x1" edc:name="EIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN8" edc:mask="0x1" edc:name="EIEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN9" edc:mask="0x1" edc:name="EIEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN10" edc:mask="0x1" edc:name="EIEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN11" edc:mask="0x1" edc:name="EIEN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN12" edc:mask="0x1" edc:name="EIEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN13" edc:mask="0x1" edc:name="EIEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN14" edc:mask="0x1" edc:name="EIEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN15" edc:mask="0x1" edc:name="EIEN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN16" edc:mask="0x1" edc:name="EIEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN17" edc:mask="0x1" edc:name="EIEN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN18" edc:mask="0x1" edc:name="EIEN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN19" edc:mask="0x1" edc:name="EIEN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN20" edc:mask="0x1" edc:name="EIEN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN21" edc:mask="0x1" edc:name="EIEN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN22" edc:mask="0x1" edc:name="EIEN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN23" edc:mask="0x1" edc:name="EIEN23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN24" edc:mask="0x1" edc:name="EIEN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN25" edc:mask="0x1" edc:name="EIEN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN26" edc:mask="0x1" edc:name="EIEN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN27" edc:mask="0x1" edc:name="EIEN27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN28" edc:mask="0x1" edc:name="EIEN28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN29" edc:mask="0x1" edc:name="EIEN29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN30" edc:mask="0x1" edc:name="EIEN30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN31" edc:mask="0x1" edc:name="EIEN31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B0F4" edc:_begin="0x8c" edc:_end="0xa0" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="27" edc:access="--------------------nnnnnnnnnnnn" edc:cname="ADCEIEN2" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="ADCEIQEN2" edc:nzwidth="32" edc:por="--------------------000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIEN32" edc:mask="0x1" edc:name="EIEN32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN33" edc:mask="0x1" edc:name="EIEN33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN34" edc:mask="0x1" edc:name="EIEN34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN35" edc:mask="0x1" edc:name="EIEN35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN36" edc:mask="0x1" edc:name="EIEN36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN37" edc:mask="0x1" edc:name="EIEN37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN38" edc:mask="0x1" edc:name="EIEN38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN39" edc:mask="0x1" edc:name="EIEN39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN40" edc:mask="0x1" edc:name="EIEN40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN41" edc:mask="0x1" edc:name="EIEN41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN42" edc:mask="0x1" edc:name="EIEN42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN43" edc:mask="0x1" edc:name="EIEN43" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
